# 安装命令行工具 (Formulas)
brew "autojump"
brew "vim"
brew "neovim"
brew "tmux"
brew "stow"
brew "yazi"
brew "docker"
brew "podman"
brew "podman-compose"
brew "lazydocker"
brew "btop"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "fish"
brew "zoxide"
brew "git-flow"
brew "git-secrets"
brew "lazygit"
brew "node"
brew "yarn"
brew "go"
brew "pipenv"
brew "pyenv"
brew "rbenv"
brew "ruby-build"
brew "direnv"
brew "ripgrep"

# 安装桌面应用 (Casks)
cask "alacritty"
cask "firefox"
cask "google-chrome"
cask "arc"
cask "ghostty"
cask "raycast"
cask "rustdesk"
cask "betterdisplay"
cask "slack"
cask "cursor"
cask "input-source-pro"
cask "apidog"
cask "obsidian"
cask "tailscale"
cask "podman-desktop"
cask "claude"
cask "orbstack"
cask "zoom"
cask "ollama"

# fonts
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "font-comic-shanns-mono-nerd-font"
